read_verilog verilog/Example.Project.topEntity/topEntity.v
flatten
synth
write_json aes2.json